RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_usart.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check USART/UART peripheral */
#define NOT_USART_PERIPH(periph)                     (((periph) != USART0) && ((periph) != USART1) && \
                                                      ((periph) != USART2) && ((periph) != UART3) && \
                                                      ((periph) != UART4) && ((periph) != USART5) && \
                                                      ((periph) != UART6) && ((periph) != UART7))
/* check USART peripheral */
#define NOT_USART0125_PERIPH(periph)                 (((periph) != USART0) && ((periph) != USART1) && \
                                                      ((periph) != USART2) && ((periph) != USART5))

/* check if the baudrate is not a USART baudrate */
#define NOT_USART_BAUDRATE(baudval)                  ((baudval) == 0U)
/* check if the parity mode is not a USART parity mode */
#define NOT_USART_PM(parity)                         (((parity) != USART_PM_NONE) && ((parity) != USART_PM_EVEN) && \
                                                      ((parity) != USART_PM_ODD))
/* check if the word length is not a USART word length */
#define NOT_USART_WL(wlen)                           (((wlen) != USART_WL_8BIT) && ((wlen) != USART_WL_9BIT) && \
                                                      ((wlen) != USART_WL_7BIT) && ((wlen) != USART_WL_10BIT))
/* check if the stop bit length is not a USART stop bit length */
#define NOT_USART_STB(stblen)                        (((stblen) != USART_STB_1BIT)   && ((stblen) != USART_STB_0_5BIT) && \
                                                      ((stblen) != USART_STB_2BIT)   && ((stblen) != USART_STB_1_5BIT))
/* check if the transmit configuration is not a USART transmit configuration */
#define NOT_USART_TRANSMIT(txconfig)                 (((txconfig) != USART_TRANSMIT_ENABLE) && ((txconfig) != USART_TRANSMIT_DISABLE))
/* check if the receive configuration is not a USART receive configuration */
#define NOT_USART_RECEIVE(rxconfig)                  (((rxconfig) != USART_RECEIVE_ENABLE) && ((rxconfig) != USART_RECEIVE_DISABLE))
/* check if the MSB/LSB first configuration is not a USART configuration */
#define NOT_USART_MSBF(msbf)                         (((msbf) != USART_MSBF_LSB) && ((msbf) != USART_MSBF_MSB))
/* check if the oversampling mode is not a USART oversampling mode */
#define NOT_USART_OVSMOD(oversamp)                   (((oversamp) != USART_OVSMOD_8) && ((oversamp) != USART_OVSMOD_16))
/* check if the oversampling bit configuration is not a USART configuration */
#define NOT_USART_OSB(osb)                           (((osb) != USART_OSB_1BIT) && ((osb) != USART_OSB_3BIT))
/* check if the receive timeout is not within the USART receive timeout range */
#define USART_RECEIVE_TIMEOUT_HIGH                   ((uint32_t)0x00FFFFFFU)
#define NOT_USART_RECEIVE_TIMEOUT(rtimeout)          (USART_RECEIVE_TIMEOUT_HIGH < (rtimeout))
/* check if the transmit data is not within the USART transmit data range */
#define USART_TRANSMIT_DATA_HIGH                     ((uint32_t)0x000003FFU)
#define NOT_USART_TRANSMIT_DATA(data)                (USART_TRANSMIT_DATA_HIGH < (data))
/* check if the command type is not a USART command type */
#define NOT_USART_CMD(cmdtype)                       (((cmdtype) != USART_CMD_SBKCMD) && ((cmdtype) != USART_CMD_MMCMD) && \
                                                      ((cmdtype) != USART_CMD_RXFCMD) && ((cmdtype) != USART_CMD_TXFCMD))
/* check if the address mode is not a USART address mode */
#define NOT_USART_ADDR_MODE(addrmod)                 (((addrmod) != USART_ADDM0_4BIT) && ((addrmod) != USART_ADDM0_FULLBIT))
/* check if the wakeup mode is not a USART wakeup mode */
#define NOT_USART_WM_METHOD(wmethod)                 (((wmethod) != USART_WM_IDLE) && ((wmethod) != USART_WM_ADDR))
/* check if the LIN break length is not a USART LIN break length */
#define NOT_USART_LBLEN_LENGTH(lblen)                (((lblen) != USART_LBLEN_10B) && ((lblen) != USART_LBLEN_11B))
/* check if the clock length mode is not a USART clock length mode */
#define NOT_USART_CLEN_MODE(clen)                    (((clen) != USART_CLEN_NONE) && ((clen) != USART_CLEN_EN))
/* check if the clock phase mode is not a USART clock phase mode */
#define NOT_USART_CPH_MODE(cph)                      (((cph) != USART_CPH_1CK) && ((cph) != USART_CPH_2CK))
/* check if the clock polarity mode is not a USART clock polarity mode */
#define NOT_USART_CPL_MODE(cpl)                      (((cpl) != USART_CPL_LOW) && ((cpl) != USART_CPL_HIGH))
/* check if the guard time is not within the USART guard time range */
#define USART_GUARD_TIME_HIGH                        ((uint32_t)0x000000FFU)
#define NOT_USART_GUARD_TIME_RANGE(guat)             (USART_GUARD_TIME_HIGH < (guat))
/* check if the smartcard auto-retry number is not within the USART smartcard auto-retry range */
#define USART_SMARTCARD_AUTORETRY_HIGH               ((uint32_t)0x00000007U)
#define NOT_USART_SMARTCARD_AUTORETRY_RANGE(scrtnum) (USART_SMARTCARD_AUTORETRY_HIGH < (scrtnum))
/* check if the block length is not within the USART block length range */
#define USART_BLOCK_LEN_HIGH                         ((uint32_t)0x000000FFU)
#define NOT_USART_BLOCK_LEN_RANGE(bl)                (USART_BLOCK_LEN_HIGH < (bl))
/* check if the IrDA smart pre-scaler is not within the USART IrDA smart pre-scaler range */
#define USART_IRDA_SMART_PRE_HIGH                    ((uint32_t)0x000000FFU)
#define NOT_USART_IRDA_SMART_PRE_RANGE(psc)          (USART_IRDA_SMART_PRE_HIGH < (psc))
/* check if the IrDA mode is not a USART IrDA mode */
#define NOT_USART_IRDA_MODE(irlp)                    (((irlp) != USART_IRLP_LOW) && ((irlp) != USART_IRLP_NORMAL))
/* check if the RTS configuration is not a USART RTS configuration */
#define NOT_USART_RTS_CONFIG(rtsconfig)              (((rtsconfig) != USART_RTS_ENABLE) && ((rtsconfig) != USART_RTS_DISABLE))
/* check if the CTS configuration is not a USART CTS configuration */
#define NOT_USART_CTS_CONFIG(ctsconfig)              (((ctsconfig) != USART_CTS_ENABLE) && ((ctsconfig) != USART_CTS_DISABLE))
/* check if the hardware flow control mode is not a USART hardware flow control mode */
#define NOT_USART_HCM_CONFIG(hcm)                    (((hcm) != USART_HCM_NONE) && ((hcm) != USART_HCM_EN))
/* check if the asser time is not within the USART DE time range */
#define USART_ASSERTIME_HIGH                         ((uint32_t)0x0000001FU)
#define NOT_USART_ASSERTIME_RANGE(dedtime)           (USART_ASSERTIME_HIGH < (dedtime))
/* check if the DE time is not within the USART DE time range */
#define USART_DE_ASSERTIME_HIGH                      ((uint32_t)0x0000001FU)
#define NOT_USART_DE_ASSERTIME_RANGE(dedtime)        (USART_DE_ASSERTIME_HIGH < (dedtime))
/* check if the DE signal configuration is not a USART DE polarity configuration */
#define NOT_USART_DEP_CONFIG(dep)                    (((dep) != USART_DEP_HIGH) && ((dep) != USART_DEP_LOW))
/* check if the receive DMA configuration is not a USART receive DMA configuration */
#define NOT_USART_RECEIVE_DMA_CONFIG(dmacmd)         (((dmacmd) != USART_RECEIVE_DMA_ENABLE) && ((dmacmd) != USART_RECEIVE_DMA_DISABLE))
/* check if the transmit DMA configuration is not a USART transmit DMA configuration */
#define NOT_USART_TRANSMIT_DMA_CONFIG(dmacmd)        (((dmacmd) != USART_TRANSMIT_DMA_ENABLE)  && ((dmacmd) != USART_TRANSMIT_DMA_DISABLE))

/* check the wakeup mode configuration */
#define NOT_USART_WAKEUP_MODE_CONFIG(wum)            (((wum) != USART_WUM_ADDR) && ((wum) != USART_WUM_STARTB) && ((wum) != USART_WUM_RBNE))
/* check if the TX FIFO threshold configuration is not a USART TX FIFO threshold configuration */
#define NOT_USART_TFTCFG_THRESHOLD_CONFIG(txthreshold)    (((txthreshold) != USART_TFTCFG_THRESHOLD_1_8) && ((txthreshold) != USART_TFTCFG_THRESHOLD_1_4) && \
                                                           ((txthreshold) != USART_TFTCFG_THRESHOLD_1_2)   && ((txthreshold) != USART_TFTCFG_THRESHOLD_3_4) && \
                                                           ((txthreshold) != USART_TFTCFG_THRESHOLD_7_8)   && ((txthreshold) != USART_TFTCFG_THRESHOLD_EMPTY))
/* check if the RX FIFO threshold configuration is not a USART RX FIFO threshold configuration */
#define NOT_USART_RFTCFG_THRESHOLD_CONFIG(rxthreshold)     (((rxthreshold) != USART_RFTCFG_THRESHOLD_1_8) && ((rxthreshold) != USART_RFTCFG_THRESHOLD_1_4) && \
                                                            ((rxthreshold) != USART_RFTCFG_THRESHOLD_1_2) && ((rxthreshold) != USART_RFTCFG_THRESHOLD_3_4) && \
                                                            ((rxthreshold) != USART_RFTCFG_THRESHOLD_7_8) && ((rxthreshold) != USART_RFTCFG_THRESHOLD_FULL))
#endif

/* function declarations */
/* initialization functions */
/* reset USART */
void usart_deinit(uint32_t usart_periph);
/* configure USART baud rate value */
void usart_baudrate_set(uint32_t usart_periph, uint32_t baudval);
/* configure USART parity function */
void usart_parity_config(uint32_t usart_periph, uint32_t paritycfg);
/* configure USART word length */
void usart_word_length_set(uint32_t usart_periph, uint32_t wlen);
/* configure USART stop bit length */
void usart_stop_bit_set(uint32_t usart_periph, uint32_t stblen);
/* enable USART */
void usart_enable(uint32_t usart_periph);
/* disable USART */
void usart_disable(uint32_t usart_periph);
/* configure USART transmitter */
void usart_transmit_config(uint32_t usart_periph, uint32_t txconfig);
/* configure USART receiver */
void usart_receive_config(uint32_t usart_periph, uint32_t rxconfig);

/* USART normal mode communication */
/* data is transmitted/received with the LSB/MSB first */
void usart_data_first_config(uint32_t usart_periph, uint32_t msbf);
/* USART inverted configure */
void usart_invert_config(uint32_t usart_periph, usart_invert_enum invertpara);
/* enable the USART overrun function */
void usart_overrun_enable(uint32_t usart_periph);
/* disable the USART overrun function */
void usart_overrun_disable(uint32_t usart_periph);
/* configure the USART oversample mode */
void usart_oversample_config(uint32_t usart_periph, uint32_t oversamp);
/* configure sample bit method */
void usart_sample_bit_config(uint32_t usart_periph, uint32_t osb);
/* enable receiver timeout */
void usart_receiver_timeout_enable(uint32_t usart_periph);
/* disable receiver timeout */
void usart_receiver_timeout_disable(uint32_t usart_periph);
/* configure receiver timeout threshold */
void usart_receiver_timeout_threshold_config(uint32_t usart_periph, uint32_t rtimeout);
/* USART transmit data function */
void usart_data_transmit(uint32_t usart_periph, uint16_t data);
/* USART receive data function */
uint16_t usart_data_receive(uint32_t usart_periph);
/* enable USART command */
void usart_command_enable(uint32_t usart_periph, uint32_t cmdtype);

/* multi-processor communication */
/* enable address 0 match mode */
void usart_address_0_match_mode_enable(uint32_t usart_periph);
/* disable address 0 match mode */
void usart_address_0_match_mode_disable(uint32_t usart_periph);
/* enable address 1 match mode */
void usart_address_1_match_mode_enable(uint32_t usart_periph);
/* disable address 1 match mode */
void usart_address_1_match_mode_disable(uint32_t usart_periph);
/* configure address 0 of the USART */
void usart_address_0_config(uint32_t usart_periph, uint8_t addr);
/* configure address 1 of the USART */
void usart_address_1_config(uint32_t usart_periph, uint8_t addr);
/* configure address 0 detection mode */
void usart_address_0_detection_mode_config(uint32_t usart_periph, uint32_t addmod);
/* configure address 1 detection mode */
void usart_address_1_detection_mode_config(uint32_t usart_periph, uint32_t addmod);
/* enable mute mode */
void usart_mute_mode_enable(uint32_t usart_periph);
/* disable mute mode */
void usart_mute_mode_disable(uint32_t usart_periph);
/* configure wakeup method in mute mode */
void usart_mute_mode_wakeup_config(uint32_t usart_periph, uint32_t wmethod);

